function changeBigCate(e) {
    var b11 = {
        ["가구리폼·수리업"]: 110100,
        ["세트가구류"]: 110300,
        ["의자류"]: 110400,
        ["장롱류"]: 110500,
        ["책상·테이블류"]: 110600,
        ["침대류"]: 110700,
        ["기타가구"]: 110200,
    };
    var b12 = {
        ["가사장비품"]: 120100,
        ["가정용공구"]: 120200,
        ["공조·냉난방기기"]: 120300,
        ["세정제·탈취제류"]: 120400,
        ["재봉·세탁·청소용품"]: 120500,
        ["조명기기"]:120600,
        ["기타가사용품"]: 120700
    };
    var b13 = {["가스"]:130100, ["석유류"]:130200, ["수도"]:130300, ["전기"]:130400, ["기타에너지"]:130500};
    var b14 = {["방문·통신교육서비스"]:140100, ["사설강습서비스"]:140200, ["자격시험"]:140300, ["학교교육서비스"]:140400};
    var b22 = {["대출"]:220100, ["리스"]:220200, ["저축"]:220300, ["카드"]:220400, ["투자"]:220500, ["할부금융"]:220600, ["기타금융"]:220700};
    var b23 = {["기계"]:230100, ["기타물품"]:230200};
    var b25 = {["가사서비스"]:250100, ["관혼상제"]:250200, ["사설학습실"]:250300, ["알선·중개·번역서비스"]:250400, ["음식서비스"]:250500, ["기타서비스"]:250600};
    var b26 = {["농약"]:260100, ["농업용기계"]:260200, ["농업용시설자재"]:260300, ["묘목·모종·종자"]:260400, ["비료"]:260500, ["어업용품"]:260600, ["축산자재"]:260700, ["기타농업용자재"]:260800};
    var b30 = {["도서·음반대여업"]:300100, ["서적·인쇄물·음반"]:300200, ["학습교재"]:300300};
    var b31 = {["관람·감상"]:310100, ["사진촬영·처리"]:310200, ["숙박시설"]:310300, ["여행"]:310400, ["회원권"]:310500, ["기타문화·오락서비스"]:310600};
    var b32 = {["광학제품"]:320100, ["사무용품"]:320200, ["시계류"]:320300, ["악기"]:320400, ["영상기기"]:320500, ["음향기기"]:320600, ["카메라·사진용품"]:320700, ["기타문화용품"]:320800};
    var b33 = {["법률서비스"]:330100, ["행정서비스"]:330200, ["기타전문서비스"]:330300};
    var b34 = {["목욕서비스"]:340100, ["복지서비스"]:340200, ["위생서비스"]:340300, ["이·미용서비스"]:340400};
    var b35 = {["시력보조기구"]:350100, ["의료용구"]:350200, ["의약품"]:350300, ["이·미용기구"]:350400, ["일반화장품"]:350500, ["기타보건·위생용품"]:350600, ["기타화장품"]:350700};
    var b36 = {["공공보험"]:360100, ["민영보험"]:360200, ["유사보험"]:360300};
    var b37 = {["세탁서비스"]:370100, ["수선·염색서비스"]:370200};
    var b38 = {["놀이·게임기구"]:380100, ["스포츠·레저기구·용품등"]:380200, ["애완동·식물"]:380300, ["완구·인형"]:380400, ["유아용승용물"]:380500, ["취미용품"]:380600};
    var b39 = {["건강식품"]:390100, ["곡류·곡류가공식품"]:390200, ["과일·과일가공식품"]:390300, ["기타식품·기호품"]:390400, ["빵·과자류"]:390500, ["식용종자·식용버섯류"]:390600,
    ["어패류·어패류가공식품"]:390700, ["유란류·유란류가공식품"]:390800, ["육류·육류가공식품"]:390900};
    var b40 = {};
    var b41 = {};
    var b42 = {};
    var b43 = {};
    var b44 = {["통신기기·액세서리"]: 1, ["컴퓨터·주변기기및소프트웨어"]: 2, ["사무용기기"]: 3};
    var b45 = {};
    var b46 = {};
    var b47 = {};
    var b18 = {};

    var b44 = {["통신기기·액세서리"]: 1, ["컴퓨터·주변기기및소프트웨어"]: 2, ["사무용기기"]: 3};

    var target = document.getElementById("SelectMidCate");

    var d;
    console.log(a);

    if (e == "440000") d = a;
    else if (e.value == "b") var d = good_b;
    else if (e.value == "c") var d = good_c;

    console.log(d);

//        target.options.length = 0;

    for (x in d) {
        var opt = document.createElement("option");
        opt.value = d[x];
        opt.innerHTML = x;
        target.appendChild(opt);
    }


}

function changeMidCate(e) {
    var b = ["스마트폰", "핸드폰", "인터넷전화기", "통신기기주변장치", "기타통신장치"];

    var smalltarget = document.getElementById("SelectSmallCate");

    var d;
    console.log(e);

    if (e == "1") d = b;
    else if (e.value == "b") var d = good_b;
    else if (e.value == "c") var d = good_c;

    console.log(d);

    smalltarget.options.length = 0;

    for (x in d) {
        var opt = document.createElement("option");
        opt.value = d[x];
        opt.innerHTML = d[x];
        smalltarget.appendChild(opt);
    }


}
