// 인덱스 select box
function changeBigCate(e) {
    // var b11 = {
    //     ["가구리폼·수리업"]: 110100, ["세트가구류"]: 110200, ["의자류"]: 110300, ["장롱류"]: 110400,  ["책상·테이블류"]: 110500,
    //     ["침대류"]: 110600, ["기타가구"]: 110700 };
    // var b12 = { ["가사장비품"]: 120100, ["가정용공구"]: 120200, ["공조·냉난방기기"]: 120300, ["세정제·탈취제류"]: 120400,
    //     ["재봉·세탁·청소용품"]: 120500, ["조명기기"]:120600, ["기타가사용품"]: 120700 };
    // var b13 = {["가스"]:130100, ["석유류"]:130200, ["수도"]:130300, ["전기"]:130400, ["기타에너지"]:130500};
    // var b14 = {["방문·통신교육서비스"]:140100, ["사설강습서비스"]:140200, ["자격시험"]:140300, ["학교교육서비스"]:140400};
    // var b22 = {["대출"]:220100, ["리스"]:220200, ["저축"]:220300, ["카드"]:220400, ["투자"]:220500, ["할부금융"]:220600, ["기타금융"]:220700};
    // var b23 = {["기계"]:230100, ["기타물품"]:230200};
    // var b25 = {["가사서비스"]:250100, ["관혼상제"]:250200, ["사설학습실"]:250300, ["알선·중개·번역서비스"]:250400, ["음식서비스"]:250500, ["기타서비스"]:250600};
    // var b26 = {["농약"]:260100, ["농업용기계"]:260200, ["농업용시설자재"]:260300, ["묘목·모종·종자"]:260400, ["비료"]:260500, ["어업용품"]:260600, ["축산자재"]:260700, ["기타농업용자재"]:260800};
    // var b30 = {["도서·음반대여업"]:300100, ["서적·인쇄물·음반"]:300200, ["학습교재"]:300300};
    // var b31 = {["관람·감상"]:310100, ["사진촬영·처리"]:310200, ["숙박시설"]:310300, ["여행"]:310400, ["회원권"]:310500, ["기타문화·오락서비스"]:310600};
    // var b32 = {["광학제품"]:320100, ["사무용품"]:320200, ["시계류"]:320300, ["악기"]:320400, ["영상기기"]:320500, ["음향기기"]:320600, ["카메라·사진용품"]:320700, ["기타문화용품"]:320800};
    // var b33 = {["법률서비스"]:330100, ["행정서비스"]:330200, ["기타전문서비스"]:330300};
    // var b34 = {["목욕서비스"]:340100, ["복지서비스"]:340200, ["위생서비스"]:340300, ["이·미용서비스"]:340400};
    // var b35 = {["시력보조기구"]:350100, ["의료용구"]:350200, ["의약품"]:350300, ["이·미용기구"]:350400, ["일반화장품"]:350500, ["기타보건·위생용품"]:350600, ["기타화장품"]:350700};
    // var b36 = {["공공보험"]:360100, ["민영보험"]:360200, ["유사보험"]:360300};
    // var b37 = {["세탁서비스"]:370100, ["수선·염색서비스"]:370200};
    // var b38 = {["놀이·게임기구"]:380100, ["스포츠·레저기구·용품등"]:380200, ["애완동·식물"]:380300, ["완구·인형"]:380400, ["유아용승용물"]:380500, ["취미용품"]:380600};
    // var b39 = {["건강식품"]:390100, ["곡류·곡류가공식품"]:390200, ["과일·과일가공식품"]:390300, ["기타식품·기호품"]:390400, ["빵·과자류"]:390500, ["식용종자·식용버섯류"]:390600, ["어패류·어패류가공식품"]:390700,
    //     ["유란류·유란류가공식품"]:390800, ["육류·육류가공식품"]:390900, ["음료"]:391000, ["조미식품"]:391100, ["주류"]:391200, ["채소·채소가공식품"]:391300, ["해조류·해조류가공식품"]:391400};
    // var b40 = {["냉장·냉동기기"]:400100, ["조리기기·기구"]:400200, ["기타식생활기기"]:400300};
    // var b41 = {["관리서비스"]:410100, ["보관서비스"]:410200, ["여객운송서비스"]:410300, ["화물운송서비스"]:410400};
    // var b42 = {["병·의원서비스"]:420100, ["수의서비스"]:420200, ["약국서비스"]:420300, ["유사의료서비스"]:420400, ["한방서비스"]:420500, ["기타의료서비스"]:420600};
    // var b43 = {["가방"]:430100, ["간편복"]:430200, ["기타의류·섬유"]:430300, ["내의류"]:430400, ["모피·가죽의류"]:430500, ["신발"]:430600, ["아동복"]:430700, ["액세서리·신변용품"]:430800,
    // ["양복"]:430900, ["옷감·실"]:431000, ["의류·섬유신변용품대여"]:431100, ["침구류"]:431200, ["한복"]:431300};
    // var b44 = {["통신기기·액세서리"]: 440100, ["컴퓨터·주변기기및소프트웨어"]: 440200, ["사무용기기"]: 440300};
    // var b45 = {["광고서비스"]:450100, ["방송서비스"]:450200, ["유선전화"]:450300, ["이동통신"]:450400, ["인터넷서비스"]:450500, ["전신·우편"]:450600, ["정보이용"]:450700};
    // var b46 = {["보온·보냉기기"]:460100, ["부엌소모품"]:460200, ["식탁용품"]:460300, ["유아용식생활용품"]:460400, ["주방설비"]:460500};
    // var b47 = {["승용자동차"]:470100, ["승합자동차"]:470200, ["이륜자동차"]:470300, ["자동차부품·소모품"]:470400, ["자동차용품"]:470500, ["자전거"]:470600, ["특수자동차·중장비"]:470700,
    // ["화물자동차"]:470800, ["기타승용물"]:470900, ["기타자동차관련업"]:480000};
    // var b48 = {["가스·급배수설비"]:480100, ["건축자재"]:480200, ["공조·냉난방시스템설비"]:480300, ["방재·방범설비"]:480400, ["보일러·온수기설비"]:480500, ["부동산임대차·중개"]:480600, ["옥외장비·설비"]:480700,
    // ["위생설비"]:480800, ["인테리어설비"]:480900, ["전기·승강설비"]:481000, ["주거관리설비"]:481100, ["주택·건물"]:481200, ["토지설비"]:4813000};

    var b11 = ["가구리폼·수리업", "세트가구류", "의자류", "장롱류", "책상·테이블류", "침대류", "기타가구"];
    var b12 = ["가사장비품", "가정용공구", "공조·냉난방기기", "세정제·탈취제류", "재봉·세탁·청소용품", "조명기기", "기타가사용품"];
    var b13 = ["가스", "석유류", "수도", "전기", "기타에너지"];
    var b14 = ["방문·통신교육서비스", "사설강습서비스", "자격시험", "학교교육서비스"];
    var b22 = ["대출", "리스", "저축", "카드", "투자", "할부금융", "기타금융"];
    var b23 = ["기계", "기타물품"];
    var b25 = ["가사서비스", "관혼상제", "사설학습실", "알선·중개·번역서비스", "음식서비스", "기타서비스"];
    var b26 = ["농약", "농업용기계", "농업용시설자재", "묘목·모종·종자", "비료", "어업용품", "축산자재", "기타농업용자재"];
    var b30 = ["도서·음반대여업", "서적·인쇄물·음반", "학습교재"];
    var b31 = ["관람·감상", "사진촬영·처리", "숙박시설", "여행", "회원권", "기타문화·오락서비스"];
    var b32 = ["광학제품", "사무용품", "시계류", "악기", "영상기기", "음향기기", "카메라·사진용품", "기타문화용품"];
    var b33 = ["법률서비스", "행정서비스", "기타전문서비스"];
    var b34 = ["목욕서비스", "복지서비스", "위생서비스", "이·미용서비스"];
    var b35 = ["시력보조기구", "의료용구", "의약품", "이·미용기구", "일반화장품", "기타보건·위생용품", "기타화장품"];
    var b36 = ["공공보험", "민영보험", "유사보험"];
    var b37 = ["세탁서비스", "수선·염색서비스"];
    var b38 = ["놀이·게임기구", "스포츠·레저기구·용품등", "애완동·식물", "완구·인형", "유아용승용물", "취미용품"];
    var b39 = ["건강식품", "곡류·곡류가공식품", "과일·과일가공식품", "기타식품·기호품", "빵·과자류", "식용종자·식용버섯류", "어패류·어패류가공식품", "유란류·유란류가공식품", "육류·육류가공식품", "음료", "조미식품", "주류", "채소·채소가공식품", "해조류·해조류가공식품"];
    var b40 = ["냉장·냉동기기", "조리기기·기구", "기타식생활기기"];
    var b41 = ["관리서비스", "보관서비스", "여객운송서비스", "화물운송서비스"];
    var b42 = ["병·의원서비스", "수의서비스", "약국서비스", "유사의료서비스", "한방서비스", "기타의료서비스"];
    var b43 = ["가방", "간편복", "기타의류·섬유", "내의류", "모피·가죽의류", "신발", "아동복", "액세서리·신변용품", "양복", "옷감·실", "의류·섬유신변용품대여", "침구류", "한복"];
    var b44 = ["통신기기·액세서리", "컴퓨터·주변기기및소프트웨어", "사무용기기"];
    var b45 = ["광고서비스", "방송서비스", "유선전화", "이동통신", "인터넷서비스", "전신·우편", "정보이용"];
    var b46 = ["보온·보냉기기", "부엌소모품", "식탁용품", "유아용식생활용품", "주방설비"];
    var b47 = ["승용자동차", "승합자동차", "이륜자동차", "자동차부품·소모품", "자동차용품", "자전거", "특수자동차·중장비", "화물자동차", "기타승용물", "기타자동차관련업"];
    var b48 = ["가스·급배수설비", "건축자재", "공조·냉난방시스템설비", "방재·방범설비", "보일러·온수기설비", "부동산임대차·중개", "옥외장비·설비", "위생설비", "인테리어설비", "전기·승강설비", "주거관리설비", "주택·건물", "토지설비"];

    var d;
    var target = document.getElementById("SelectMidCate");
    target.options.length = 0;
    target.add(new Option('전체', ''));

    if (e == "가구") d = b11;
    else if (e == "가사용품") d = b12;
    else if (e == "광열·수도") d = b13;
    else if (e == "교육서비스") d = b14;
    else if (e == "금융") d = b22;
    else if (e == "기계류기타물품") d = b23;
    else if (e == "기타서비스") d = b25;
    else if (e == "농·수·축산용품") d = b26;
    else if (e == "도서·음반") d = b30;
    else if (e == "문화·오락서비스") d = b31;
    else if (e == "문화용품") d = b32;
    else if (e == "법률·행정서비스") d = b33;
    else if (e == "보건·위생서비스") d = b34;
    else if (e == "보건·위생용품") d = b35;
    else if (e == "보험") d = b36;
    else if (e == "세탁서비스") d = b37;
    else if (e == "스포츠·레저·취미용품") d = b38;
    else if (e == "식료품·기호품") d = b39;
    else if (e == "식생활기기") d = b40;
    else if (e == "운수·보관·관리서비스") d = b41;
    else if (e == "의료서비스") d = b42;
    else if (e == "의류·섬유신변용품") d = b43;
    else if (e == "정보통신기기") d = b44;
    else if (e == "정보통신서비스") d = b45;
    else if (e == "주방용품·설비") d = b46;
    else if (e == "차량·승용물") d = b47;
    else if (e == "토지·건물·설비") d = b48;
    else target.options.length = 0;

    for (x in d) {
        var opt = document.createElement("option");

        opt.value = d[x];
        opt.innerHTML = d[x];
        target.appendChild(opt);
    }
}

function changeMidCate(e) {
    // var b = ["스마트폰", "핸드폰", "인터넷전화기", "통신기기주변장치", "기타통신장치"];

    var smalltarget = document.getElementById("SelectSmallCate");

    var d;
    console.log(e);

    if (e == "1") d = b;
    // else if (e.value == "b") var d = good_b;
    // else if (e.value == "c") var d = good_c;

    smalltarget.options.length = 0;

    for (x in d) {
        var opt = document.createElement("option");
        opt.value = d[x];
        opt.innerHTML = d[x];
        smalltarget.appendChild(opt);
    }
}


// 해결기준 select box
$(document).ready(function () {
    $('#Upjong').change(function () {

        $.getJSON('/_update_gijun', {
            selected_class: $('#Upjong').val()

        }).success(function (data) {
            $('#Trouble1').html(data.html_string_selected);
        })
    });
});